Revit 2027 API
BuiltInFailures.ViewFailures.BadViewDirectionSetting Property
 Plan view DBViewType has invalid view direction parameter.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId BadViewDirectionSetting { get; }
Public Shared ReadOnly Property BadViewDirectionSetting As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ BadViewDirectionSetting {
	FailureDefinitionId^ get ();
}
static member BadViewDirectionSetting : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ViewFailures Class
Autodesk.Revit.DB Namespace